Revit 2027 API
FabricationPart.OptimizeLengths Method
 Optimizes the length fabrication straight parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> OptimizeLengths(
	Document document,
	ISet<ElementId> partIds
)
Public Shared Function OptimizeLengths (
	document As Document,
	partIds As ISet(Of ElementId)
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ OptimizeLengths(
	Document^ document,
	ISet<ElementId^>^ partIds
)
static member OptimizeLengths :
        document : Document *
        partIds : ISet<ElementId> -> ISet<ElementId>
Parameters
document Document
 The document.
partIds ISet<ElementId>
 The identifiers of the fabrication parts in a selected fabrication part run.
Return Value
ISet<ElementId>
 New and modified fabrication part ids in the optimize
Exceptions
Exception | Condition
ArgumentException |  There are no straight parts to optimize, or all parts are locked or locked by group membership.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace